Public Enum 宏操作类型
    未知
    ''' <summary>
    ''' 切换视图到已弃置。没有参数。
    ''' </summary>
    切换到已弃置
    ''' <summary>
    ''' 切换视图到待整理。没有参数。
    ''' </summary>
    切换到待整理
    ''' <summary>
    ''' 重置过滤器。参数：<para/>
    ''' 重置整理视图，可选，默认为 False。<para/>
    ''' 重置御魂种类，可选，默认为 True。
    ''' </summary> 
    重置
    ''' <summary>
    ''' 全选并弃置当前视图显示的御魂。参数：<para/>
    ''' 弃置带锁的御魂，可选，默认为 False。
    ''' </summary>
    全选并弃置
    ''' <summary>
    ''' 勾选指定的御魂类型。参数：<para/>
    ''' 种类，必填。如果是御魂名字，直接写御魂名字。否则要写 {查找御魂 主属性名}
    ''' </summary>
    勾选御魂类型
    ''' <summary>
    ''' 去掉指定的御魂类型。参数：<para/>
    ''' 种类，必填。如果是御魂名字，直接写御魂名字。否则要写 {查找御魂 主属性名}
    ''' </summary>
    去掉御魂类型
    ''' <summary>
    ''' 清空御魂类型的选项，过滤时不再考虑类型。没有参数。
    ''' </summary>
    清空御魂类型
    ''' <summary>
    ''' 勾选御魂的位置。参数：<para/>
    ''' 御魂的位置，逗号分隔的1~6整数，必填。
    ''' </summary>
    勾选位置
    ''' <summary>
    ''' 取消勾选御魂的位置选择。参数：<para/>
    ''' 御魂的位置，逗号分隔的1~6整数，必填。
    ''' </summary>
    去掉位置
    ''' <summary>
    ''' 勾选御魂的星级。参数：<para/>
    ''' 御魂的星级，逗号分隔的1~6整数，必填。
    ''' </summary>
    勾选星级
    ''' <summary>
    ''' 去掉御魂的星级选择。参数：<para/>
    ''' 御魂的星级，逗号分隔的1~6整数，必填。
    ''' </summary>
    去掉星级
    ''' <summary>
    ''' 勾选御魂的主属性。参数：<para/>
    ''' 御魂的主属性，逗号分隔的御魂属性简体中文名称(不能有错别字)，必填。
    ''' </summary>
    勾选主属性
    ''' <summary>
    ''' 去掉御魂的主属性去掉。参数：<para/>
    ''' 御魂的主属性，逗号分隔的御魂属性简体中文名称(不能有错别字)，必填。
    ''' </summary>
    去掉主属性
    ''' <summary>
    ''' 选中御魂的副属性的 ⚪ 。参数：<para/>
    ''' 御魂的副属性，逗号分隔的御魂属性简体中文名称(不能有错别字)，必填。
    ''' </summary>
    勾选副属性
    ''' <summary>
    ''' 选中御魂的副属性的 × 。参数：<para/>
    ''' 御魂的副属性，逗号分隔的御魂属性简体中文名称(不能有错别字)，必填。
    ''' </summary>
    排除副属性
    ''' <summary>
    ''' 取消选中御魂的副属性的 ⚪ 或 × 。参数：<para/>
    ''' 御魂的副属性，逗号分隔的御魂属性简体中文名称(不能有错别字)，必填。
    ''' </summary>
    清除副属性
    ''' <summary>
    ''' 勾选御魂的条数。参数：<para/>
    ''' 御魂的副属性条数，必填，逗号分隔的 &lt;2, 2, 3 或者 4。
    ''' </summary>
    勾选副属性条数
    ''' <summary>
    ''' 取消勾选御魂的条数。参数：<para/>
    ''' 御魂的副属性条数，必填，逗号分隔的 &lt;2, 2, 3 或者 4。
    ''' </summary>
    去掉副属性条数
End Enum
