Public Enum 御魂种类
    雪幽魂 = 300002
    地藏像 = 300003
    蝠翼 = 300004
    涅槃之火 = 300006
    三味 = 300007
    魍魉之匣 = 300008
    被服 = 300009
    招财猫 = 300010
    反枕 = 300011
    轮入道 = 300012
    日女巳时 = 300013
    镜姬 = 300014
    钟灵 = 300015
    狰 = 300018
    火灵 = 300019
    鸣屋 = 300020
    薙魂 = 300021
    心眼 = 300022
    木魅 = 300023
    树妖 = 300024
    网切 = 300026
    阴摩罗 = 300027
    伤魂鸟 = 300029
    破势 = 300030
    镇墓兽 = 300031
    珍珠 = 300032
    骰子鬼 = 300033
    蚌精 = 300034
    魅妖 = 300035
    针女 = 300036
    返魂香 = 300039
    狂骨 = 300048
    幽谷响 = 300049
    土蜘蛛 = 300050
    胧车 = 300051
    荒骷髅 = 300052
    地震鲶 = 300053
    蜃气楼 = 300054
    飞缘魔 = 300073
    兵主部 = 300074
    青女房 = 300075
    涂佛 = 300076
    鬼灵歌伎 = 300077
End Enum

''' <summary>
''' 御魂种类的常见简称或者拼错形式
''' </summary>
Public Enum 御魂种类别名
    <Obsolete("改用 地藏像")>
    地藏 = 御魂种类.地藏像
    <Obsolete("改用 蝠翼")>
    蝙翼 = 御魂种类.蝠翼
    <Obsolete("改用 涅槃之火")>
    涅槃 = 御魂种类.涅槃之火
    <Obsolete("改用 魍魉之匣")>
    魍魉 = 御魂种类.魍魉之匣
    <Obsolete("改用 招财猫")>
    招财 = 御魂种类.招财猫
    <Obsolete("改用 日女巳时")>
    日女 = 御魂种类.日女巳时
    <Obsolete("改用 鬼灵歌伎")>
    鬼灵歌姬 = 御魂种类.鬼灵歌伎
    <Obsolete("改用 鬼灵歌伎")>
    歌姬 = 御魂种类.鬼灵歌伎
    <Obsolete("改用 鬼灵歌伎")>
    歌伎 = 御魂种类.鬼灵歌伎
    <Obsolete("改用 薙魂")>
    稚魂 = 御魂种类.薙魂
    <Obsolete("改用 薙魂")>
    雉魂 = 御魂种类.薙魂
    <Obsolete("改用 三味")>
    三昧 = 御魂种类.三味
End Enum
